"""
Алгоритм - это совокупность четко опреденных действий, выполение которых ведет к решению задачи

Свойства:
- дискретность - должен состоять из элементарных действий, которые выполняются последовательно.
  пока не закончится выполнение предыдущего действия, следующее не начнется
- детерминированность - все действия в алгоритме должны быть строко определены.
  ни одно из них не должно двояко трактоваться исполнителем
- конечность - должен выполняться за строгое конечное число шагов
- массовость - должен вести к результату при любых исходных данных
- результативность - работа алгоритма должна вести к результату

Способы представления:
- словесный
- псевдокод
- графический
- программный

Виды:
- линейный
- разветвляющийся
- циклический
"""



